import java.text.MessageFormat;

// 1. Создать классы Собака и Кот с наследованием от класса Животное.
public class Animal {
    String name;

    public Animal() {
    }

    public Animal(String name) {
        this.name = name;
    }

    public void animalInfo() {
        System.out.println();

    }
}